Modules/Laporan/app/Http/Controllers/LaporanController.php

select * from `laporan` where `user_id` = 2 order by `created_at` desc
select * from `users` where `users`.`id` in (1, 4, 5, 6, 7, 8, 9, 10)
select count(*) as aggregate from `laporan`
select * from `laporan` where `user_id` = 2 order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in (2)
select count(*) as aggregate from `laporan` where `user_id` = 2
---
    public function index()
    {
        // Admin sees all reports; regular users see only their own
        if (Auth::check() && Auth::user()->role === 'admin') {
            $laporan = Laporan::with(['user', 'kategori', 'bukti'])->latest()->paginate(10);
        } else {
            $laporan = Laporan::with(['user', 'kategori', 'bukti'])
                ->where('user_id', Auth::id())
                ->latest()
                ->paginate(10);

select * from `bukti` where `bukti`.`kode_laporan` in (53)
select * from `laporan` where `kode_laporan` = '53' limit 1
select * from `users` where `users`.`id` in (10)
---
    public function show($kode_laporan)
    {
        $laporan = Laporan::with(['kategori', 'bukti', 'user'])
            ->where('kode_laporan', $kode_laporan)
            ->firstOrFail();