app/Http/Controllers/DashboardController.php

select status_tindakan, count(*) as total from `laporan` group by `status_tindakan`
select count(*) as aggregate from `kontaks`
---
    public function index()
    {
        // 1. Logic Hitung Data (Efficient grouping)
        $stats = Laporan::selectRaw('status_tindakan, count(*) as total')
            ->groupBy('status_tindakan')
            ->pluck('total', 'status_tindakan');

        $totalLaporan   = $stats->sum();
        $laporanPending = $stats->get('Pending', 0);
        $laporanSelesai = $stats->get('Selesai', 0);

        // 2. Data untuk Grafik - Tren Laporan 7 Hari Terakhir
        $trendLaporan = $this->getTrendLaporan();

        // 3. Data untuk Grafik - Status Laporan (Pie Chart)
        $statusData = $this->getStatusData();

        // 4. Total Pesan Kontak Masuk
        $totalPesan = Kontak::count();

select DATE(created_at) as date, count(*) as total from `laporan` where `created_at` >= '2025-12-21 00:00:00' group by `date`
---
    private function getTrendLaporan()
    {
        $startDate = Carbon::now()->subDays(6)->startOfDay();

        $laporanCounts = Laporan::where('created_at', '>=', $startDate)
            ->selectRaw('DATE(created_at) as date, count(*) as total')
            ->groupBy('date')
            ->pluck('total', 'date');

select `status_tindakan`, count(*) as total from `laporan` group by `status_tindakan`
---
    private function getStatusData()
    {
        $statuses = Laporan::select('status_tindakan', DB::raw('count(*) as total'))
            ->groupBy('status_tindakan')
            ->pluck('total', 'status_tindakan')
            ->toArray();