app/Http/Controllers/NewsController.php

select * from `users` where `users`.`id` in (1)
---
    public function index(Request $request)
    {
        $search = $request->input('search');

        $news = News::with('user')->published()
            ->when($search, function ($query, $search) {
                $query->where(function ($q) use ($search) {
                    $q->where('title', 'like', "%{$search}%")
                        ->orWhere('content', 'like', "%{$search}%")
                        ->orWhere('excerpt', 'like', "%{$search}%");
                });
            })
            ->latest('published_at')
            ->paginate(6)
            ->withQueryString()
            ->through(fn($item) => [
                'id' => $item->id,
                'title' => $item->title,
                'slug' => $item->slug,
                'excerpt' => $item->excerpt,
                'image' => $item->image,
                'author' => $item->user ? $item->user->name : 'Admin',
                'published_at' => $item->published_at->translatedFormat('d F Y'),
            ]);

select * from `users` where `users`.`id` in (1)
---
    public function show($slug)
    {
        $newsItem = News::with('user')->where('slug', $slug)
            ->published()
            ->firstOrFail();

        return Inertia::render('News/Show', [
            'news' => [
                'id' => $newsItem->id,
                'title' => $newsItem->title,
                'slug' => $newsItem->slug,
                'content' => $newsItem->content,
                'image' => $newsItem->image,
                'author' => $newsItem->user ? $newsItem->user->name : 'Admin',
                'published_at' => $newsItem->published_at->translatedFormat('l, d F Y H:i'),
                'related' => News::with('user')->where('id', '!=', $newsItem->id)
                    ->published()
                    ->latest('published_at')
                    ->take(3)
                    ->get()
                    ->map(fn($item) => [
                        'title' => $item->title,
                        'slug' => $item->slug,
                        'image' => $item->image,
                        'published_at' => $item->published_at->translatedFormat('d M Y'),
                    ]),
            ],
            'page_title' => $newsItem->title,
        ]);

select * from `news` order by `created_at` desc limit 6 offset 6
select count(*) as aggregate from `news`
---
    public function adminIndex(Request $request)
    {
        $search = $request->input('search');

        $news = News::with('user')
            ->when($search, function ($query, $search) {
                $query->where(function ($q) use ($search) {
                    $q->where('title', 'like', "%{$search}%")
                        ->orWhere('content', 'like', "%{$search}%")
                        ->orWhere('excerpt', 'like', "%{$search}%");
                });
            })
            ->latest('created_at')
            ->paginate(6)
            ->withQueryString()
            ->through(fn($item) => [
                'id' => $item->id,
                'title' => $item->title,
                'slug' => $item->slug,
                'excerpt' => $item->excerpt,
                'image' => $item->image,
                'author' => $item->user ? $item->user->name : 'Admin',
                'is_published' => $item->is_published,
                'published_at' => $item->published_at?->format('d M Y'),
                'created_at' => $item->created_at->format('d M Y'),