app/Http/Controllers/PageController.php

select * from `laporan` order by `created_at` desc
select * from `users` where `users`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
---
    public function berita()
    {
        $laporan = Laporan::with(['user', 'kategori', 'bukti'])
            ->latest()
            ->get();